## Terraform Plan Result


### environments/stg/network/subnet
```
  + create
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-southeast-2"
      + route_table_id = "rtb-0368f8134f58d4b21"
      + subnet_id      = (known after apply)
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.128.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-2"
      + tags                                           = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-01"
          + "Project"     = "STP-2025"
      + tags_all                                       = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-01"
          + "Project"     = "STP-2025"
      + vpc_id                                         = "vpc-07fd028d1425bded5"
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-southeast-2"
      + route_table_id = "rtb-03a02398fc7d6a130"
      + subnet_id      = (known after apply)
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.129.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-2"
      + tags                                           = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-02"
          + "Project"     = "STP-2025"
      + tags_all                                       = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-02"
          + "Project"     = "STP-2025"
      + vpc_id                                         = "vpc-07fd028d1425bded5"
Plan: 4 to add, 0 to change, 0 to destroy.
Changes to Outputs:
  + private_subnet_ids = [
      + (known after apply),
      + (known after apply),
```
<!-- Sticky Pull Request Commentterraform-plan -->